---
type: ExternallyTaggedBRep
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# ExternallyTaggedBRep

`Autodesk.Revit.DB.ExternallyTaggedBRep` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetTaggedGeometry | 2022 | `public GeometryObject GetTaggedGeometry ( ExternalGeometryId externalId )` |